Renesas-Software-and-Digitalization/qcs_lab/UniversityProgram/bgk_ra6e2_freertos_sensor_to_ble_customization/req_1_change_temperature_sensor_units/bgk_ra6e2_freertos/src/qe_gen/ble/ble_app.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2019-2020 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/

/******************************************************************************
 * File Name    : app_main.c
 * Device(s)    : RA4W1
 * Tool-Chain   : e2Studio
 * Description  : This is a application file for peripheral role.
 *******************************************************************************/

/******************************************************************************
 Includes   <System Includes> , "Project Includes"
 *******************************************************************************/
#include <string.h>
#include "r_ble_api.h"
#include "rm_ble_abs.h"
#include "rm_ble_abs_api.h"
#include "gatt_db.h"
#include "profile_cmn/r_ble_servs_if.h"
#include "profile_cmn/r_ble_servc_if.h"
#include "hal_data.h"
#include "user.h"


/* This code is needed for using FreeRTOS */
#if (BSP_CFG_RTOS == 2 || BSP_CFG_RTOS_USED == 1)
#include "FreeRTOS.h"
#include "task.h"
#include "event_groups.h"
#include "ble_thread.h"
#define BLE_EVENT_PATTERN   (0x0A0A)
EventGroupHandle_t  g_ble_event_group_handle;
#endif
#include "r_ble_qc_svcs.h"

/******************************************************************************
 User file includes
 *******************************************************************************/
/* Start user code for file includes. Do not edit comment generated here */
#include "qe_ble_profile.h"
#include "gui_cfg.h"
#include "qc_svc.h"
#include "common_utils.h"
#include "ble_app.h"
#include "sm.h"
// Uncomment the desired debug level
#include "log_disabled.h"
//#include "log_error.h"
//#include "log_warning.h"
//#include "log_info.h"
//#include "log_debug.h"
/* End user code. Do not edit comment generated here */

#define BLE_LOG_TAG "app_main"
#define BLE_GATTS_QUEUE_ELEMENTS_SIZE       (14)
#define BLE_GATTS_QUEUE_BUFFER_LEN          (245)
#define BLE_GATTS_QUEUE_NUM                 (1)

/******************************************************************************
 User macro definitions
 *******************************************************************************/
/* Start user code for macro definitions. Do not edit comment generated here */
#define BLE_OPTIMAL_MTU                     101
#define EVENT_BIT_NOTIFY_CFM                (1UL << 0)
/* End user code. Do not edit comment generated here */

/******************************************************************************
 Generated function prototype declarations
 *******************************************************************************/
/* Internal functions */
void gap_cb(uint16_t type, ble_status_t result, st_ble_evt_data_t *p_data);
void gatts_cb(uint16_t type, ble_status_t result, st_ble_gatts_evt_data_t *p_data);
void gattc_cb(uint16_t type, ble_status_t result, st_ble_gattc_evt_data_t *p_data);
void vs_cb(uint16_t type, ble_status_t result, st_ble_vs_evt_data_t *p_data);
ble_status_t ble_init(void);
void app_main(void);

/******************************************************************************
 User function prototype declarations
 *******************************************************************************/
/* Start user code for function prototype declarations. Do not edit comment generated here */
static void handle_read_gui_req(uint16_t id, uint8_t const * const data);
static void handle_write_led(uint16_t id, uint8_t const * const data);
static void handle_read_version(uint16_t id, uint8_t const * const data);
static void send_qc_svc_response(uint8_t const * const p_data, uint16_t len);
static void led_timer_cb(TimerHandle_t xTimer);
static void handle_read_data(uint16_t id, uint8_t const * const data);
static const char pre_adv_data[] = "US000-";

/* End user code. Do not edit comment generated here */
#define MAX_ADV_DATA_LENGTH 		(20)
#define ADV_DATA_LEN 				(sizeof(adv_data) - 1)
#define PRE_ADV_DATA_LEN 			(sizeof(pre_adv_data) - 1)

/* Advertising Data */
static uint8_t gs_advertising_data[5 + PRE_ADV_DATA_LEN + ADV_DATA_LEN] =
{
    /* Flags */
    0x02, /**< Data Size */
    0x01, /**< Data Type */
    0x06, /**< Data Value */

    /* Complete Local Name */
	(PRE_ADV_DATA_LEN + ADV_DATA_LEN + 1), /**< Data Size */
    0x09, /**< Data Type */
};

ble_abs_legacy_advertising_parameter_t g_ble_advertising_parameter =
{
 .p_peer_address             = NULL,       ///< Peer address.
 .slow_advertising_interval  = 0x000000A0, ///< Slow advertising interval. 100.0(ms)
 .slow_advertising_period    = 0x0000,     ///< Slow advertising period.
 .p_advertising_data         = gs_advertising_data,             ///< Advertising data. If p_advertising_data is specified as NULL, advertising data is not set.
 .advertising_data_length    = ARRAY_SIZE(gs_advertising_data), ///< Advertising data length (in bytes).
 .advertising_filter_policy  = BLE_ABS_ADVERTISING_FILTER_ALLOW_ANY, ///< Advertising Filter Policy.
 .advertising_channel_map    = ( BLE_GAP_ADV_CH_37 | BLE_GAP_ADV_CH_38 | BLE_GAP_ADV_CH_39 ), ///< Channel Map.
 .own_bluetooth_address_type = BLE_GAP_ADDR_RAND, ///< Own Bluetooth address type.
 .own_bluetooth_address      = { 0 },
};

/* GATT server callback parameters */
ble_abs_gatt_server_callback_set_t gs_abs_gatts_cb_param[] =
{
 {
  .gatt_server_callback_function = gatts_cb,
  .gatt_server_callback_priority = 1,
 },
 {
  .gatt_server_callback_function = NULL,
 }
};

/* GATT client callback parameters */
ble_abs_gatt_client_callback_set_t gs_abs_gattc_cb_param[] =
{
 {
  .gatt_client_callback_function = gattc_cb,
  .gatt_client_callback_priority = 1,
 },
 {
  .gatt_client_callback_function = NULL,
 }
};

/* GATT server Prepare Write Queue parameters */
static st_ble_gatt_queue_elm_t  gs_queue_elms[BLE_GATTS_QUEUE_ELEMENTS_SIZE];
static uint8_t gs_buffer[BLE_GATTS_QUEUE_BUFFER_LEN];
static st_ble_gatt_pre_queue_t gs_queue[BLE_GATTS_QUEUE_NUM] = {
                                                                {
                                                                 .p_buf_start = gs_buffer,
                                                                 .buffer_len  = BLE_GATTS_QUEUE_BUFFER_LEN,
                                                                 .p_queue     = gs_queue_elms,
                                                                 .queue_size  = BLE_GATTS_QUEUE_ELEMENTS_SIZE,
                                                                }
};

/* Connection handle */
uint16_t g_conn_hdl;

