Renesas-Software-and-Digitalization/qcs_lab/UniversityProgram/bgk_ra6e2_freertos_sensor_to_ble_customization/req_1_change_temperature_sensor_units/bgk_ra6e2_freertos/src/qe_gen/ble/ble_app.c
/******************************************************************************
 User global variables
 *******************************************************************************/
/* Start user code for global variables. Do not edit comment generated here */
static TimerHandle_t      led_timer;
static EventGroupHandle_t event_group;
static char   * version_str           = "1.0.0";
static bool     led_on                = false;
extern QueueHandle_t g_sensor_queue;
// These are the handlers used by the BLE service to send/receive data
static const qc_svc_request_handlers_t qc_sv_req_handlers[] =
{
      /* Object ID   Read Handler                  Write Handler  SM handler*/
      { 0x0000,      handle_read_gui_req,          NULL,          {0}},
      { 0x0100,      NULL,                         handle_write_led,          {0}},
      { 0x0201,      handle_read_data,              NULL,{.channel=0,.address=0,.internal=1}                        },
      
      { 0x0202,      handle_read_data,              NULL,{.channel=1,.address=0,.internal=1}                        },
      
      { 0x0301,      handle_read_version,          NULL,         {0}},
      { 0xFFFF,      NULL,                         NULL,          {0}}
};
static float sensor_data_array[3];



/* End user code. Do not edit comment generated here */

/******************************************************************************
 Generated function definitions
 *******************************************************************************/
/******************************************************************************
 * Function Name: gap_cb
 * Description  : Callback function for GAP API.
 * Arguments    : uint16_t type -
 *                  Event type of GAP API.
 *              : ble_status_t result -
 *                  Event result of GAP API.
 *              : st_ble_vs_evt_data_t *p_data - 
 *                  Event parameters of GAP API.
 * Return Value : none
 ******************************************************************************/
void gap_cb(uint16_t type, ble_status_t result, st_ble_evt_data_t *p_data)
{
    /* Hint: Input common process of callback function such as variable definitions */
    /* Start user code for GAP callback function common process. Do not edit comment generated here */
    switch(type)
    {
        case BLE_GAP_EVENT_CONN_IND:
        {
            if (BLE_SUCCESS == result)
            {
                uint16_t mtu;
                st_ble_gap_conn_evt_t *p_gap_conn_evt_param = (st_ble_gap_conn_evt_t *)p_data->p_param;

                /* Turn green LED on to show that someone has connected to us */
                xTimerStop(led_timer, 0);
                utils_set_LED(GREEN_LED, BSP_IO_LEVEL_HIGH);

                if (BLE_SUCCESS == R_BLE_GATT_GetMtu(p_gap_conn_evt_param->conn_hdl, &mtu))
                {
                    if (mtu > BLE_OPTIMAL_MTU)
                    {
                        mtu = BLE_OPTIMAL_MTU;
                    }
                    /* Notifications used to send data have an overhead of 3 bytes */
                    (void)qc_svc_set_transport_mtu(mtu - 3);
                }
            }
        }
        break;

        case BLE_GAP_EVENT_DISCONN_IND:
        {
            utils_set_LED(GREEN_LED, BSP_IO_LEVEL_LOW);
            led_on = true;
            xTimerStart(led_timer, 0);
        }
        break;

        default:
        {
            ; /* Do nothing */
        }
        break;
    }

    /* End user code. Do not edit comment generated here */

    switch(type)
    {
        case BLE_GAP_EVENT_STACK_ON:
        {
            /* Get BD address for Advertising */
            R_BLE_VS_GetBdAddr(BLE_VS_ADDR_AREA_REG, BLE_GAP_ADDR_RAND);
        } break;

        case BLE_GAP_EVENT_CONN_IND:
        {
            if (BLE_SUCCESS == result)
            {
                /* Store connection handle */
                st_ble_gap_conn_evt_t *p_gap_conn_evt_param = (st_ble_gap_conn_evt_t *)p_data->p_param;
                g_conn_hdl = p_gap_conn_evt_param->conn_hdl;
            }
            else
            {
                /* Restart advertising when connection failed */
                RM_BLE_ABS_StartLegacyAdvertising(&g_ble_abs0_ctrl, &g_ble_advertising_parameter);
            }
        } break;

        case BLE_GAP_EVENT_DISCONN_IND:
        {
            /* Restart advertising when disconnected */
            g_conn_hdl = BLE_GAP_INVALID_CONN_HDL;
            RM_BLE_ABS_StartLegacyAdvertising(&g_ble_abs0_ctrl, &g_ble_advertising_parameter);
        } break;

        case BLE_GAP_EVENT_CONN_PARAM_UPD_REQ:
        {
            /* Send connection update response with value received on connection update request */
            st_ble_gap_conn_upd_req_evt_t *p_conn_upd_req_evt_param = (st_ble_gap_conn_upd_req_evt_t *)p_data->p_param;

            st_ble_gap_conn_param_t conn_updt_param = {
                                                       .conn_intv_min = p_conn_upd_req_evt_param->conn_intv_min,
                                                       .conn_intv_max = p_conn_upd_req_evt_param->conn_intv_max,
                                                       .conn_latency  = p_conn_upd_req_evt_param->conn_latency,
                                                       .sup_to        = p_conn_upd_req_evt_param->sup_to,
            };

            R_BLE_GAP_UpdConn(p_conn_upd_req_evt_param->conn_hdl,
                    BLE_GAP_CONN_UPD_MODE_RSP,
                    BLE_GAP_CONN_UPD_ACCEPT,
                    &conn_updt_param);
        } break;

        /* Hint: Add cases of GAP event macros defined as BLE_GAP_XXX */
        /* Start user code for GAP callback function event process. Do not edit comment generated here */
        /* End user code. Do not edit comment generated here */
    }
}

/******************************************************************************
 * Function Name: gatts_cb
 * Description  : Callback function for GATT Server API.
 * Arguments    : uint16_t type -
 *                  Event type of GATT Server API.
 *              : ble_status_t result -
 *                  Event result of GATT Server API.
 *              : st_ble_gatts_evt_data_t *p_data - 
 *                  Event parameters of GATT Server API.
 * Return Value : none
 ******************************************************************************/
void gatts_cb(uint16_t type, ble_status_t result, st_ble_gatts_evt_data_t *p_data)
{
    /* Hint: Input common process of callback function such as variable definitions */
    /* Start user code for GATT Server callback function common process. Do not edit comment generated here */
    switch(type)
    {
        case BLE_GATTS_EVENT_DB_ACCESS_IND:
        {
            st_ble_gatts_db_access_evt_t * p_gatts_db_access_evt = p_data->p_param;
            st_ble_gatt_value_t * p_gatt_value = &p_gatts_db_access_evt->p_params->value;

            if (BLE_GATTS_OP_CHAR_PEER_WRITE_REQ == p_gatts_db_access_evt->p_params->db_op)
            {
                if (QE_ATTRIBUTE_HANDLE_CHARACTERISTIC_VALUE_QC_SVC_QC_REQ == p_gatts_db_access_evt->p_params->attr_hdl)
                {
                    qc_svc_handle_request((uint8_t *)p_gatt_value->p_value, p_gatt_value->value_len);
                }
            }
        }
        break;

        case BLE_GATTS_EVENT_HDL_VAL_CNF:
        {
            st_ble_gatts_cfm_evt_t * p_gatts_cfm_evt = p_data->p_param;

            if (QE_ATTRIBUTE_HANDLE_CHARACTERISTIC_VALUE_QC_SVC_QC_RSP == p_gatts_cfm_evt->attr_hdl)
            {
                xEventGroupSetBits(event_group, EVENT_BIT_NOTIFY_CFM);
            }
        }
        break;

        default:
        {
            /* Unhandled event type - do nothing */
        }
        break;
    }

    /* Not using the QE generated GATTS code */
    return;
    /* End user code. Do not edit comment generated here */

