Renesas-Software-and-Digitalization/qcs_lab/UniversityProgram/bgk_ra6e2_freertos_sensor_to_ble_customization/req_1_change_temperature_sensor_units/bgk_ra6e2_freertos/src/qe_gen/ble/ble_app.c
    R_BLE_SERVS_GattsCb(type, result, p_data);
    switch(type)
    {
        /* Hint: Add cases of GATT Server event macros defined as BLE_GATTS_XXX */
        /* Start user code for GATT Server callback function event process. Do not edit comment generated here */
        /* End user code. Do not edit comment generated here */
    }
}

/******************************************************************************
 * Function Name: gattc_cb
 * Description  : Callback function for GATT Client API.
 * Arguments    : uint16_t type -
 *                  Event type of GATT Client API.
 *              : ble_status_t result -
 *                  Event result of GATT Client API.
 *              : st_ble_gattc_evt_data_t *p_data - 
 *                  Event parameters of GATT Client API.
 * Return Value : none
 ******************************************************************************/
void gattc_cb(uint16_t type, ble_status_t result, st_ble_gattc_evt_data_t *p_data)
{
    /* Hint: Input common process of callback function such as variable definitions */
    /* Start user code for GATT Client callback function common process. Do not edit comment generated here */
    /* End user code. Do not edit comment generated here */

    R_BLE_SERVC_GattcCb(type, result, p_data);
    switch(type)
    {

        /* Hint: Add cases of GATT Client event macros defined as BLE_GATTC_XXX */
        /* Start user code for GATT Client callback function event process. Do not edit comment generated here */
        /* End user code. Do not edit comment generated here */
    }
}

/******************************************************************************
 * Function Name: vs_cb
 * Description  : Callback function for Vendor Specific API.
 * Arguments    : uint16_t type -
 *                  Event type of Vendor Specific API.
 *              : ble_status_t result -
 *                  Event result of Vendor Specific API.
 *              : st_ble_vs_evt_data_t *p_data - 
 *                  Event parameters of Vendor Specific API.
 * Return Value : none
 ******************************************************************************/
void vs_cb(uint16_t type, ble_status_t result, st_ble_vs_evt_data_t *p_data)
{
    /* Hint: Input common process of callback function such as variable definitions */
    /* Start user code for vender specific callback function common process. Do not edit comment generated here */
    /* End user code. Do not edit comment generated here */

    R_BLE_SERVS_VsCb(type, result, p_data);
    switch(type)
    {
        case BLE_VS_EVENT_GET_ADDR_COMP:
        {
            /* Start advertising when BD address is ready */
            st_ble_vs_get_bd_addr_comp_evt_t * get_address = (st_ble_vs_get_bd_addr_comp_evt_t *)p_data->p_param;
            memcpy(g_ble_advertising_parameter.own_bluetooth_address, get_address->addr.addr, BLE_BD_ADDR_LEN);
            RM_BLE_ABS_StartLegacyAdvertising(&g_ble_abs0_ctrl, &g_ble_advertising_parameter);
        } break;

        /* Hint: Add cases of vender specific event macros defined as BLE_VS_XXX */
        /* Start user code for vender specific callback function event process. Do not edit comment generated here */
        /* End user code. Do not edit comment generated here */
    }
}

/******************************************************************************
 * Function Name: qc_svcs_cb
 * Description  : Callback function for Quick Connect Service server feature.
 * Arguments    : uint16_t type -
 *                  Event type of Quick Connect Service server feature.
 *              : ble_status_t result -
 *                  Event result of Quick Connect Service server feature.
 *              : st_ble_servs_evt_data_t *p_data - 
 *                  Event parameters of Quick Connect Service server feature.
 * Return Value : none
 ******************************************************************************/
static void qc_svcs_cb(uint16_t type, ble_status_t result, st_ble_servs_evt_data_t *p_data)
{
    /* Hint: Input common process of callback function such as variable definitions */
    /* Start user code for Quick Connect Service Server callback function common process. Do not edit comment generated here */
    FSP_PARAMETER_NOT_USED(result);
    FSP_PARAMETER_NOT_USED(p_data);
    /* End user code. Do not edit comment generated here */

    switch(type)
    {
        /* Hint: Add cases of Quick Connect Service server events defined in e_ble_qc_svcs_event_t */
        /* Start user code for Quick Connect Service Server callback function event process. Do not edit comment generated here */
        /* End user code. Do not edit comment generated here */
    }    
}
/******************************************************************************
 * Function Name: ble_init
 * Description  : Initialize BLE and profiles.
 * Arguments    : none
 * Return Value : BLE_SUCCESS - SUCCESS
 *                BLE_ERR_INVALID_OPERATION -
 *                    Failed to initialize BLE or profiles.
 ******************************************************************************/
ble_status_t ble_init(void)
{
    ble_status_t status;
    fsp_err_t err;
	if (ADV_DATA_LEN > MAX_ADV_DATA_LENGTH) {
        return BLE_ERR_INVALID_DATA;
	}

    memcpy(&gs_advertising_data[5], pre_adv_data, PRE_ADV_DATA_LEN);
    memcpy(&gs_advertising_data[5+PRE_ADV_DATA_LEN], adv_data, ADV_DATA_LEN);

    /* Initialize BLE */
    err = RM_BLE_ABS_Open(&g_ble_abs0_ctrl, &g_ble_abs0_cfg);
    if (FSP_SUCCESS != err)
    {
        return err;
    }

    /* Initialize GATT Database */
    status = R_BLE_GATTS_SetDbInst(NULL);
    /* There is known issue causing BLE_ERR_GATT_WRITE_NOT_PERMITTED on the FSP5.9.0 */
    if (BLE_SUCCESS != status && BLE_ERR_GATT_WRITE_NOT_PERMITTED != status)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

    /* Initialize GATT server */
    status = R_BLE_SERVS_Init();
    if (BLE_SUCCESS != status)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

    /*Initialize GATT client */
    status = R_BLE_SERVC_Init();
    if (BLE_SUCCESS != status)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

    /* Set Prepare Write Queue */
    R_BLE_GATTS_SetPrepareQueue(gs_queue, BLE_GATTS_QUEUE_NUM);

    /* Initialize Quick Connect Service server API */
    status = R_BLE_QC_SVCS_Init(qc_svcs_cb);
    if (BLE_SUCCESS != status)
    {
        return BLE_ERR_INVALID_OPERATION;
    }

