Renesas-Software-and-Digitalization/qcs_lab/UniversityProgram/bgk_ra6e2_freertos_sensor_to_ble_customization/req_1_change_temperature_sensor_units/bgk_ra6e2_freertos/src/qe_gen/ble/ble_app.c
    return status;
}

/******************************************************************************
 * Function Name: app_main
 * Description  : Application main function with main loop
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
void ble_app_init(void) {
#if (BSP_CFG_RTOS == 2 || BSP_CFG_RTOS_USED == 1)
    /* Create Event Group */
    g_ble_event_group_handle = xEventGroupCreate();
    assert(g_ble_event_group_handle);
#endif

    /* Initialize BLE and profiles */
    ble_init();

    /* Hint: Input process that should be done before main loop such as calling initial function or variable definitions */
    /* Start user code for process before main loop. Do not edit comment generated here */
    log_info("BLE Custom App init\n");

    /* Start timer used to blink LED, indicating connection status */
    led_timer = xTimerCreate( "led_timer", pdMS_TO_TICKS(500), pdTRUE, NULL, led_timer_cb);
    xTimerStart(led_timer, 0);

    event_group = xEventGroupCreate();

    (void)qc_svc_register_handlers(&qc_sv_req_handlers[0]);
    (void)qc_svc_register_transmit_cb(send_qc_svc_response);
}

void ble_app_run(void) {
        /* Process BLE Event */
        R_BLE_Execute();
        /* When this BLE application works on the FreeRTOS */
#if (BSP_CFG_RTOS == 2 || BSP_CFG_RTOS_USED == 1)
    if(0 != R_BLE_IsTaskFree()) {
            /* If the BLE Task has no operation to be processed, it transits block state until the event from RF transciever occurs. */
            xEventGroupWaitBits(g_ble_event_group_handle,
                                (EventBits_t)BLE_EVENT_PATTERN,
                                pdTRUE,
                                pdFALSE,
                                portMAX_DELAY);
        }
#endif
        sm_sensor_data sensor_data;
        EventBits_t event_bits = xEventGroupGetBits(event_group);
        if (event_bits & EVENT_BIT_NOTIFY_CFM) {
            xEventGroupClearBits(event_group, EVENT_BIT_NOTIFY_CFM);
            qc_svc_handle_response_write_cfm();
        }
        if (pdTRUE == xQueueReceive(g_sensor_queue, &sensor_data, 0)) {
            uint32_t index = 2;
            while (index < (uint32_t)sm_get_total_sensor_count()+2) {
                if (qc_sv_req_handlers[index].sensor_handler.value == sensor_data.handle.value) {
                    sm_scaling scaling;
                    sm_get_sensor_scaling(sensor_data.handle, &scaling);
                    float floatData = ((float)sensor_data.data * (float)scaling.multiplier)/(float)scaling.divider + (float)scaling.offset;
                    
                    if (sm_get_sensor_type_by_handle(qc_sv_req_handlers[index].sensor_handler) == TEMPERATURE)
                    {
                        floatData = ((floatData * 18) / 10) + 32;
                    }

                    sensor_data_array[index-2] = floatData;
                    break;
                }
                index++;
            }
        }
    }

void ble_app_close(void) {
    /* Terminate BLE */
    RM_BLE_ABS_Close(&g_ble_abs0_ctrl);
}

/******************************************************************************
 User function definitions
 *******************************************************************************/
/* Start user code for function definitions. Do not edit comment generated here */
static void handle_read_gui_req(uint16_t id, uint8_t const * const data)
{
    FSP_PARAMETER_NOT_USED(id);
    FSP_PARAMETER_NOT_USED(data);

    uint16_t len = strlen((char *)gui_cfg);

    if (0 < len)
    {
        qc_svc_send_read_response(QC_SVC_SUCCESS, id, len, (uint8_t *)&gui_cfg[0]);
    }
}

static void handle_write_led(uint16_t id, uint8_t const * const data)
{
    FSP_PARAMETER_NOT_USED(id);
    log_info("sending id: 0x%04x\n", id);
    if (data[4] == 0x00)
    {
        utils_set_LED(BLUE_LED,BSP_IO_LEVEL_LOW);
    }
    else
    {
        utils_set_LED(BLUE_LED,BSP_IO_LEVEL_HIGH);
    }
}

static void handle_read_version(uint16_t id, uint8_t const * const data)
{
    FSP_PARAMETER_NOT_USED(data);

    qc_svc_send_read_response(QC_SVC_SUCCESS, id, (uint16_t)strlen(version_str), (uint8_t *)version_str);
}

static void send_qc_svc_response(uint8_t const * const p_data, uint16_t len)
{
    st_ble_gatt_hdl_value_pair_t hdl_value_pair;

    hdl_value_pair.attr_hdl        = QE_ATTRIBUTE_HANDLE_CHARACTERISTIC_VALUE_QC_SVC_QC_RSP;
    hdl_value_pair.value.p_value   = (uint8_t *)p_data;
    hdl_value_pair.value.value_len = len;

    (void)R_BLE_GATTS_Notification(g_conn_hdl, &hdl_value_pair);
}

static void led_timer_cb(TimerHandle_t xTimer)
{
    FSP_PARAMETER_NOT_USED(xTimer);

    if (true == led_on)
    {
        utils_set_LED(GREEN_LED, BSP_IO_LEVEL_LOW);
        led_on = false;
    }
    else
    {
        utils_set_LED(GREEN_LED,BSP_IO_LEVEL_HIGH);
        led_on = true;
    }
}

static void handle_read_data(uint16_t id, uint8_t const * const data)
{
    FSP_PARAMETER_NOT_USED(data);
    uint32_t index = 2;
    while (index < (uint32_t)sm_get_total_sensor_count()+2) {
        if (qc_sv_req_handlers[index].id == id) {
            log_debug("Sending id: 0x%04x");
            qc_svc_send_read_response(QC_SVC_SUCCESS, id, sizeof(sensor_data_array[0]), (uint8_t *)&sensor_data_array[index-2]);
            break;
        }
        index++;
    }
}

/* End user code. Do not edit comment generated here */
